In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/afoone/caipc-mar-2023/master/data/Ecom%20Expense.csv')

In [4]:
df.head()

,Transaction ID,Age,Items,Monthly Income,Transaction Time,Record,Gender,City Tier,Total Spend
0,TXN001,42,10,7313,627.668127,5,Female,Tier 1,4198.385084
1,TXN002,24,8,17747,126.904567,3,Female,Tier 2,4134.976648
2,TXN003,47,11,22845,873.469701,2,Male,Tier 2,5166.614455
3,TXN004,50,11,18552,380.219428,7,Female,Tier 1,7784.447676
4,TXN005,60,2,14439,403.374223,2,Female,Tier 2,3254.160485

In [5]:
df.describe()

,Age,Items,Monthly Income,Transaction Time,Record,Total Spend
count,2362.000000,2362.000000,2362.000000,2362.000000,2362.000000,2362.000000
mean,40.084674,7.884843,15962.884843,497.429603,4.928874,6163.176416
std,11.973412,4.283014,8046.517234,286.065147,3.084855,2799.772060
min,20.000000,1.000000,2003.000000,0.463297,0.000000,1099.815246
25%,30.000000,4.000000,9086.750000,253.443599,2.000000,3949.683101
50%,40.000000,8.000000,15764.000000,495.098046,5.000000,5602.193897
75%,51.000000,12.000000,23056.750000,745.833710,7.750000,8046.755618
max,60.000000,15.000000,30000.000000,1000.697201,10.000000,13944.048160

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2362 entries, 0 to 2361
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    2362 non-null   object
 1   Age               2362 non-null   int64
 2    Items            2362 non-null   int64
 3   Monthly Income    2362 non-null   int64
 4   Transaction Time  2362 non-null   float64
 5   Record            2362 non-null   int64
 6   Gender            2362 non-null   object
 7   City Tier         2362 non-null   object
 8   Total Spend       2362 non-null   float64
dtypes: float64(2), int64(4), object(3)
memory usage: 166.2+ KB

In [7]:
df['Gender'].value_counts()

Male      1200
Female    1162
Name: Gender, dtype: int64

In [8]:
df['City Tier'].value_counts()

Tier 1    815
Tier 2    782
Tier 3    765
Name: City Tier, dtype: int64

In [10]:
df['Gender'].apply(lambda x: 1 if x == 'Male' else 0) # no se hace asi

0       0
1       0
2       1
3       0
4       0
       ..
2357    1
2358    1
2359    0
2360    0
2361    1
Name: Gender, Length: 2362, dtype: int64